# CouplerCoupledEngagement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerCoupledEngagement Property
ParameterTypeId Class See Also
---
"Bar Engagement 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerCoupledEngagement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerCoupledEngagement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerCoupledEngagement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace